УНФ_ТЕСТ/src/InformationRegisters/НастройкиЗаписьНаУслуги/НастройкиЗаписьНаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗаписьНаУслуги</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникЗаписи</name>
    <type>
      <types>EnumRef.ЗаписьНаУслугиИсточник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.КлючевыеРесурсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.ОбменУправлениеНебольшойФирмойСайт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ВключаяХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/Enums/ЗаписьНаУслугиИсточник/ЗаписьНаУслугиИсточник.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗаписьНаУслугиИсточник</name>
  <enumValues>
    <name>Сайт</name>
  </enumValues>
  <enumValues>
    <name>Чатбот</name>
  </enumValues>
  <enumValues>
    <name>МобильноеПриложение</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ВариантыЗаписиНаУслуги/ВариантыЗаписиНаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗаписиНаУслуги</name>
  <enumValues>
    <name>ЗаписьНаВремя</name>
  </enumValues>
  <enumValues>
    <name>ЗаписьБезВремени</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ВариантыОтбораУслуг/ВариантыОтбораУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтбораУслуг</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>ПоГруппам</name>
  </enumValues>
  <enumValues>
    <name>ПоКатегориям</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Catalogs/КлючевыеРесурсы/КлючевыеРесурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючевыеРесурсы</name>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРесурса</name>
    <type>
      <types>CatalogRef.Бригады</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьШагИнтервалаВДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГрафикПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЗагрузкуТолькоВРабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГрафикСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.КлючевыеРесурсыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/CommonModules/КонструкторМобильногоПриложения/Module.bsl
#Область ПрограммныйИнтерфейс

// Создает или выключает доступ служебного пользователя Мобильного личного кабинета.
// Требуется для авторизации http-сервиса ОбменМЛК.
//
// Параметры:
//  Включить - Булево - Истина при включении Мобильного личного кабинета.
// 
// Возвращаемое значение:
//   - Булево
//
Функция СоздатьИзменитьСлужебногоПользователяМобильногоЛичногоКабинета(Включить = Ложь) Экспорт
	
	ЛогинПользователя = СлужебныйПользовательМЛКЛогин();
	ПарольПользователя = СлужебныйПользовательМЛКПароль();
	
	РолиПользователя = Новый Массив;
	РолиПользователя.Добавить(Метаданные.Роли.ИспользованиеМетодовМобильногоЛичногоКабинета.Имя);
	РолиПользователя.Добавить(Метаданные.Роли.ЗапускВебКлиента.Имя);
	РолиПользователя.Добавить(Метаданные.Роли.ЗапускМобильногоКлиента.Имя);
	РолиПользователя.Добавить(Метаданные.Роли.ЗапускТонкогоКлиента.Имя);
	РолиПользователя.Добавить(Метаданные.Роли.СохранениеДанныхПользователя.Имя);
	РолиПользователя.Добавить(Метаданные.Роли.ВыводНаПринтерФайлБуферОбмена.Имя);
	
	Возврат СоздатьСлужебногоПользователяИнтеграции(ЛогинПользователя, ПарольПользователя, РолиПользователя, Включить);
	
КонецФункции

Функция СоздатьИзменитьСлужебногоПользователяКабинетКлиента(Включить = Ложь) Экспорт
	
	ЛогинПользователя = СлужебныйПользовательКабинетКлиентаЛогин();
	ПарольПользователя = СлужебныйПользовательКабинетКлиентаПароль();
	
	РолиПользователя = Новый Массив;
	РолиПользователя.Добавить(Метаданные.Роли.ИспользованиеМетодовКабинетКлиента.Имя);
	
	Возврат СоздатьСлужебногоПользователяИнтеграции(ЛогинПользователя, ПарольПользователя, РолиПользователя, Включить);
	
КонецФункции

Процедура ФормированиеПакетовДляМЛКПередЗаписью(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Константы.ИспользоватьМобильныйЛичныйКабинет.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Справочники.НастройкиПубликацииМЛК.ОнлайнЗаписьВключена() Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("СправочникОбъект.Номенклатура") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗаписьНаУслуги.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.НастройкиЗаписьНаУслуги КАК НастройкиЗаписьНаУслуги
		|ГДЕ
		|	НастройкиЗаписьНаУслуги.ИсточникЗаписи = ЗНАЧЕНИЕ(Перечисление.ЗаписьНаУслугиИсточник.МобильноеПриложение)
		|	И НастройкиЗаписьНаУслуги.Услуга = &Услуга";
		
		Запрос.УстановитьПараметр("Услуга", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.КлючевыеРесурсы") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗаписьНаУслуги.Услуга КАК Услуга
		|ИЗ
		|	РегистрСведений.НастройкиЗаписьНаУслуги КАК НастройкиЗаписьНаУслуги
		|ГДЕ
		|	НастройкиЗаписьНаУслуги.ИсточникЗаписи = ЗНАЧЕНИЕ(Перечисление.ЗаписьНаУслугиИсточник.МобильноеПриложение)
		|	И НастройкиЗаписьНаУслуги.Ресурс = &Ресурс";
		
		Запрос.УстановитьПараметр("Ресурс", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	КонецЕсли;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ФоновыеЗадания.Выполнить("КонструкторМобильногоПриложения.СформироватьПакетОнлайнЗаписи",,,"Формирование пакетов для МЛК");
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПакетОнлайнЗаписи() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПубликацииМЛК.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиПубликацииМЛК КАК НастройкиПубликацииМЛК";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СсылкаКонструктор = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

	НачатьТранзакцию();
	
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиПубликацииМЛК");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", СсылкаКонструктор);
		Блокировка.Заблокировать();
		
		ЗаблокироватьДанныеДляРедактирования(СсылкаКонструктор);
		КонструкторОбъект = СсылкаКонструктор.ПолучитьОбъект();
		
		КонструкторОбъект.ВерсияОнлайнЗаписи = КонструкторОбъект.ВерсияОнлайнЗаписи + 1;
		
		СформироватьПакетСУслугами(КонструкторОбъект, ПолучитьВидЦен());
		СформироватьПакетСРесурсами(КонструкторОбъект);
		СформироватьПакетСРесурсамиИУслугами(КонструкторОбъект);
		
		КонструкторОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьВидЦен()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПубликацииМЛК.ВидЦенУслуг КАК ВидЦенУслуг
		|ИЗ
		|	Справочник.НастройкиПубликацииМЛК КАК НастройкиПубликацииМЛК";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ВидЦенУслуг;
	КонецЕсли;
	
КонецФункции

Процедура СформироватьПакетСРесурсамиИУслугами(Знач ТекущийОбъект) Экспорт
	
	Если ТекущийОбъект.ВариантЗаписиНаУслуги = Перечисления.ВариантыЗаписиНаУслуги.ЗаписьБезВремени И НЕ ТекущийОбъект.ИспользоватьВыборРесурса Тогда
		Таб = Новый ТаблицаЗначений;
		ТекущийОбъект.ПакетСРесурсамиИУслугами = Новый ХранилищеЗначения(Таб, Новый СжатиеДанных(9));
		Возврат;
	КонецЕсли;
	
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("УИУслуги");
	Таб.Колонки.Добавить("УИРесурса");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиЗаписьНаУслуги.Услуга.Ссылка КАК УслугаСсылка,
	|	НастройкиЗаписьНаУслуги.Ресурс.Ссылка КАК РесурсСсылка
	|ИЗ
	|	РегистрСведений.НастройкиЗаписьНаУслуги КАК НастройкиЗаписьНаУслуги
	|ГДЕ
	|	НастройкиЗаписьНаУслуги.ИсточникЗаписи = ЗНАЧЕНИЕ(Перечисление.ЗаписьНаУслугиИсточник.МобильноеПриложение)
	|	И НЕ НастройкиЗаписьНаУслуги.Услуга.ПометкаУдаления
	|	И НЕ НастройкиЗаписьНаУслуги.Ресурс.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = Таб.Добавить();
		Стр.УИУслуги = ВыборкаДетальныеЗаписи.УслугаСсылка.УникальныйИдентификатор();
		Стр.УИРесурса = ВыборкаДетальныеЗаписи.РесурсСсылка.УникальныйИдентификатор();
	КонецЦикла;
	
	ТекущийОбъект.ПакетСРесурсамиИУслугами = Новый ХранилищеЗначения(Таб, Новый СжатиеДанных(9));
	
КонецПроцедуры

Процедура СформироватьПакетСРесурсами(Знач ТекущийОбъект) Экспорт
	
	Если ТекущийОбъект.ВариантЗаписиНаУслуги = Перечисления.ВариантыЗаписиНаУслуги.ЗаписьБезВремени И НЕ ТекущийОбъект.ИспользоватьВыборРесурса Тогда
		Таб = Новый ТаблицаЗначений;
		ТекущийОбъект.ПакетСРесурсами = Новый ХранилищеЗначения(Таб, Новый СжатиеДанных(9));
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегистрСведенийНастройкиЗаписьНаУслуги.Ресурс.Ссылка КАК РесурсСсылка,
	|	РегистрСведенийНастройкиЗаписьНаУслуги.Ресурс.Наименование КАК РесурсНаименование,
	|	КлючевыеРесурсы.ФайлКартинки КАК ФайлКартинки
	|ИЗ
	|	РегистрСведений.НастройкиЗаписьНаУслуги КАК РегистрСведенийНастройкиЗаписьНаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеРесурсы КАК КлючевыеРесурсы
	|		ПО РегистрСведенийНастройкиЗаписьНаУслуги.Ресурс = КлючевыеРесурсы.Ссылка
	|ГДЕ
	|	РегистрСведенийНастройкиЗаписьНаУслуги.ИсточникЗаписи = ЗНАЧЕНИЕ(Перечисление.ЗаписьНаУслугиИсточник.МобильноеПриложение)
	|	И НЕ КлючевыеРесурсы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("УИ");
	Таб.Колонки.Добавить("Наименование");
	Таб.Колонки.Добавить("Картинка");
	Таб.Колонки.Добавить("Описание");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = Таб.Добавить();
		Стр.УИ = ВыборкаДетальныеЗаписи.РесурсСсылка.УникальныйИдентификатор();
		Стр.Наименование = ВыборкаДетальныеЗаписи.РесурсНаименование;
		Стр.Описание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.РесурсСсылка, "Комментарий"); // Версия 1.1.1
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ФайлКартинки) И ТекущийОбъект.ИспользоватьКартинкиРесурсов Тогда
			Стр.Картинка = Новый ХранилищеЗначения(РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаДетальныеЗаписи.ФайлКартинки), Новый СжатиеДанных(9));
		Иначе
			Стр.Картинка = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(9));
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущийОбъект.ПакетСРесурсами = Новый ХранилищеЗначения(Таб, Новый СжатиеДанных(9));
	
КонецПроцедуры

Процедура СформироватьПакетСУслугами(Знач ТекущийОбъект, ВидЦенУслуг) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегистрСведенийНастройкиЗаписьНаУслуги.Услуга.Ссылка КАК УслугаСсылка,
	|	РегистрСведенийНастройкиЗаписьНаУслуги.Услуга.Наименование КАК УслугаНаименование,
	|	РегистрСведенийНастройкиЗаписьНаУслуги.Длительность КАК Длительность,
	|	Номенклатура.ФайлКартинки КАК ФайлКартинки,
	|	Номенклатура.Родитель.Ссылка КАК РодительСсылка,
	|	Номенклатура.Родитель.Наименование КАК РодительНаименование,
	|	Номенклатура.КатегорияНоменклатуры.Ссылка КАК КатегорияНоменклатурыСсылка,
	|	Номенклатура.КатегорияНоменклатуры.Наименование КАК КатегорияНоменклатурыНаименование
	|ИЗ
	|	РегистрСведений.НастройкиЗаписьНаУслуги КАК РегистрСведенийНастройкиЗаписьНаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО РегистрСведенийНастройкиЗаписьНаУслуги.Услуга = Номенклатура.Ссылка
	|ГДЕ
	|	РегистрСведенийНастройкиЗаписьНаУслуги.ИсточникЗаписи = ЗНАЧЕНИЕ(Перечисление.ЗаписьНаУслугиИсточник.МобильноеПриложение)
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И РегистрСведенийНастройкиЗаписьНаУслуги.Ресурс % ЗНАЧЕНИЕ(Справочник.КлючевыеРесурсы.ПустаяСсылка)";
	
	Если ТекущийОбъект.ВариантЗаписиНаУслуги = Перечисления.ВариантыЗаписиНаУслуги.ЗаписьБезВремени И НЕ ТекущийОбъект.ИспользоватьВыборРесурса Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%", "=");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%", "<>");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("УИ");
	Таб.Колонки.Добавить("Наименование");
	Таб.Колонки.Добавить("Длительность");
	Таб.Колонки.Добавить("Цена");
	Таб.Колонки.Добавить("Картинка");
	Таб.Колонки.Добавить("УИГруппы");
	Таб.Колонки.Добавить("НаименованиеГруппы");
	Таб.Колонки.Добавить("Описание");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Стр = Таб.Добавить();
		Стр.УИ = ВыборкаДетальныеЗаписи.УслугаСсылка.УникальныйИдентификатор();
		Стр.Наименование = ВыборкаДетальныеЗаписи.УслугаНаименование;
		Стр.Длительность = ВыборкаДетальныеЗаписи.Длительность;
		Стр.Описание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.УслугаСсылка, "Комментарий"); // Версия 1.1.1
		
		Стр.Цена = ПолучитьЦенуУслуги(ВыборкаДетальныеЗаписи.УслугаСсылка, ВидЦенУслуг);
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ФайлКартинки) И ТекущийОбъект.ИспользоватьКартинкиУслуг Тогда
			Стр.Картинка = Новый ХранилищеЗначения(РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаДетальныеЗаписи.ФайлКартинки), Новый СжатиеДанных(9));
		Иначе
			Стр.Картинка = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(9));
		КонецЕсли;
		
		Если ТекущийОбъект.ВариантОтбораУслуг = Перечисления.ВариантыОтбораУслуг.ПоГруппам И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РодительСсылка) Тогда
			Стр.УИГруппы = ВыборкаДетальныеЗаписи.РодительСсылка.УникальныйИдентификатор();
			Стр.НаименованиеГруппы = ВыборкаДетальныеЗаписи.РодительНаименование;
		ИначеЕсли ТекущийОбъект.ВариантОтбораУслуг = Перечисления.ВариантыОтбораУслуг.ПоКатегориям И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КатегорияНоменклатурыСсылка) Тогда
			Стр.УИГруппы = ВыборкаДетальныеЗаписи.КатегорияНоменклатурыСсылка.УникальныйИдентификатор();
			Стр.НаименованиеГруппы = ВыборкаДетальныеЗаписи.КатегорияНоменклатурыНаименование;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущийОбъект.ПакетСУслугами = Новый ХранилищеЗначения(Таб, Новый СжатиеДанных(9));
	
КонецПроцедуры

Функция ПолучитьЦенуУслуги(УслугаСсылка, ВидЦенУслуг) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦен = &ВидЦен
	|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("ВидЦен", ВидЦенУслуг);
	Запрос.УстановитьПараметр("Номенклатура", УслугаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;

	
КонецФункции

Процедура ФормированиеПакетовДляМЛКПриЗаписиНабораЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Константы.ИспользоватьМобильныйЛичныйКабинет.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Справочники.НастройкиПубликацииМЛК.ОнлайнЗаписьВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиЗаписьНаУслуги.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.НастройкиЗаписьНаУслуги КАК НастройкиЗаписьНаУслуги
	|ГДЕ
	|	НастройкиЗаписьНаУслуги.ИсточникЗаписи = ЗНАЧЕНИЕ(Перечисление.ЗаписьНаУслугиИсточник.МобильноеПриложение)
	|	И НастройкиЗаписьНаУслуги.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", Источник.Отбор.Номенклатура.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ФоновыеЗадания.Выполнить("КонструкторМобильногоПриложения.СформироватьПакетОнлайнЗаписи",,,"Формирование пакетов для МЛК");
	КонецЕсли;

КонецПроцедуры

Функция ВерсияМЛК() Экспорт

	Возврат "2.0.6";

КонецФункции // ()

Процедура ЗаписатьИдентификаторНовостиМЛКПередУдалением(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.НовостиМЛКДляОтправки.ЗаписатьНовостьДляОтправки(Источник.Ссылка.УникальныйИдентификатор(), ТекущаяДатаСеанса());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьСлужебногоПользователяИнтеграции(Логин, Пароль, Роли, Включить)
	
	УстановитьПривилегированныйРежим(Истина);
	ПользовательИзСправочника = Пользователи.НайтиПоИмени(Логин);
	УстановитьПривилегированныйРежим(Ложь);
	
	Попытка
		Если ПользовательИзСправочника = Неопределено Тогда
			
			ИмяСобытия = "МобильныйЛичныйКабинет.СозданиеСлужебногоПользователя";
			
			ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
			ОписаниеПользователяИБ.Имя = Логин;
			ОписаниеПользователяИБ.ПолноеИмя = НСтр("ru='Мобильное приложение ""Кабинет клиента""'");
			ОписаниеПользователяИБ.АутентификацияСтандартная = Включить;
			ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
			ОписаниеПользователяИБ.Вставить("Действие", "Записать");
			ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Истина);
			ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль = Истина;
			ОписаниеПользователяИБ.Пароль = Пароль;
			ОписаниеПользователяИБ.Роли = Роли;
			
			НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
			НовыйПользователь.Наименование = ОписаниеПользователяИБ.ПолноеИмя;
			НовыйПользователь.Служебный = Истина;
			НовыйПользователь.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			НовыйПользователь.Записать();
			
		ИначеЕсли ПользовательИзСправочника.Наименование = "Служебный пользователь мобильного личного кабинета" Тогда
			
			ПользовательИзСправочникаОбъект = ПользовательИзСправочника.ПолучитьОбъект();
			ПользовательИзСправочникаОбъект.Наименование = НСтр("ru='Мобильное приложение ""Кабинет клиента""'");
			ПользовательИзСправочникаОбъект.Записать();
			
			ИмяСобытия = "МобильныйЛичныйКабинет.ИзменениеДоступаСлужебногоПользователя";
			ИзменитьДоступВБазуСлужебногоПользователяИнтеграции(Включить, Пароль, ПользовательИзСправочника);
			
		Иначе
			
			ИмяСобытия = "МобильныйЛичныйКабинет.ИзменениеДоступаСлужебногоПользователя";
			ИзменитьДоступВБазуСлужебногоПользователяИнтеграции(Включить, Пароль, ПользовательИзСправочника);
			
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Пользователи, ПользовательИзСправочника);
		Возврат Истина;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

Процедура ИзменитьДоступВБазуСлужебногоПользователяИнтеграции(Включить, Знач Пароль, Знач ПользовательИзСправочника)
	
	ОбновляемыеСвойства = Новый Структура;
	ОбновляемыеСвойства.Вставить("СтарыйПароль", Пароль);
	ОбновляемыеСвойства.Вставить("АутентификацияСтандартная", Включить);
	
	УстановитьПривилегированныйРежим(Истина);
	Пользователи.УстановитьСвойстваПользователяИБ(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательИзСправочника, "ИдентификаторПользователяИБ"),
		ОбновляемыеСвойства,
		Ложь,
		Ложь);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция СлужебныйПользовательМЛКПароль()
	Возврат "c3804122-a756-4aad-a9ff-5de8db9b1397";
КонецФункции

Функция СлужебныйПользовательМЛКЛогин()
	Возврат "UserMLK";
КонецФункции

Функция СлужебныйПользовательКабинетКлиентаПароль() Экспорт
	Возврат "a0c3bdd0-9699-11ea-1e9e-0242ac130004";
КонецФункции

Функция СлужебныйПользовательКабинетКлиентаЛогин() Экспорт
	Возврат "UserClients";
КонецФункции

Функция ЗаписьJSONВСтруктуру(Знач СтруктураЗначений) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураЗначений);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ЧтениеJSONВСтруктуру(Знач СтруктураВСтроке) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтруктураВСтроке);
	
	Возврат ПрочитатьJSON(ЧтениеJSON);

КонецФункции

#КонецОбласти
